/***************************************************************************
*Copyright(c) 2018,深圳鹏林电子有限公司
*All rights reserved.
*
*文件名称：INT.c
*摘    要：
*
*
*当前版本：V1.0
*作    者：yehuoyan
*完成日期：2018年6月8日17:08:06
*
*
*取代版本：
*作    者：
*完成日期：
******************************************************************************/
#include "INT.h"
u8 i;
extern unsigned char idata ISP_RAM[32]; // IRAM 0Xe0 to 0Xff
extern unsigned char code  ISP_ROM[32]_at_ 0x0200; // IRAM 0Xe0 to 0Xff
/******************************************************************************
* 时    间：2018年6月8日17:00:15
* 函数名称：void Timer0_Init(void)
* 函数功能：外部中断0初始化函数
* 备    注：    
* 修    改：无
 ********************************************************************************/
void INT_Init(void)
{
	PEDGE = 0X08;//外部中断1下降沿出触发
	EX1  = 1;//允许外部中断1
	IE1  = 1;//外部中断请求标志位
	EAL   = 1;//允许所有中断
	
	P0 = 0X00;
	P0M = 0X03;
}
/******************************************************************************
* 时    间：2018年6月8日17:00:15
* 函数名称：void INT0_ISR(void) interrupt 1
* 函数功能：外部中断0中断服务函数
* 备    注：    
* 修    改：无
 ********************************************************************************/
void INT0_ISR(void) interrupt 0
{
	
}
/******************************************************************************
* 时    间：2018年6月8日17:00:15
* 函数名称：void INT1_ISR(void) interrupt 2
* 函数功能：外部中断1中断服务函数
* 备    注：    
* 修    改：无
 ********************************************************************************/
void INT1_ISR(void) interrupt	ISRInt1
{
	LED0 = 0;
	writeTM1668_data(9,6,0,1,0,0,3);
	ISP_RAM_INIT();
	_nop_();
	_nop_();
	ISP_RAM[0] = 0x05;
	SYSIspStart(0x0200);

}










